int main()
{
  int mas[6][12] = { {0,0,0,0,0,0,0,0,0,0,0,0}, {0,0,0,0,0,0,0,1,1,1,1,1}, {0,0,0,0,0,0,0,1,1,1,1,1}, {0,0,0,0,0,0,0,1,1,1,1,1}, 
  {0,0,0,0,1,1,1,2,3,3,3,3}, {0,0,0,0,1,1,2,3,4,4,4,4}, {0,0,0,0,1,1,1,2,3,3,3,3} }; 
  
  
}

int count()
{
  int n;
  int m;
  int i;
  
  i = 0;
  n = 6; // надо указать ширину
  m = 12; // и длину как-то через функции, которые валяются в algo.c
  
  while (i <= 6)
  {
    i
}
 
int init_mas(int width, int mas)
{
  int i;
  int j;
  
  i = 0;
  j = 0;
  int arr[width][width];
  
  while (i < width)
  {
    j = 0;
    while (j < width)
    {
      arr[i][j] = mas[i][j];
      j++;
    }
    i++;
  }
}
  
int check()
{
  
}
  
  
  
  
  
